<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5abf1fde5327c4d505e3ab81df0683470e823e076d1d22305affbb5e39674e6e","plan_job_ref":"Job terraform plan #106 at https://github.com/suzutan/infra/actions/runs/15217378126","plan_out_hash":"6e9ee8394551fc4187b26edc13c70f75c3b77c1205b162af23e67445f33e2869","plan_hash":"a8a9b6e98608eca3f018ace5c085c0da150ad0da35311e4e51592e37ff45158c","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/suzutan.jp__
<details>
<summary>Plan: 0 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.atria will be updated in-place
!~  resource "cloudflare_dns_record" "atria" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "5c2bd30962c7b1f013b9dd3eacb33356"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-05-18T08:15:28Z" -> (known after apply)
!~      name                = "atria.suzutan.jp" -> "atria"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.bluesky_site_verification will be updated in-place
!~  resource "cloudflare_dns_record" "bluesky_site_verification" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "e895419ec0a8ee15e34fbc09adf0e58f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "_atproto.suzutan.jp" -> "_atproto"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "3bf9b747c9c154c527790ecf3a54fdd1"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "osk.nw.suzutan.jp" -> "osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.rt_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "rt_osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "e65f8dd460b681cc4b40c1374b46fa3a"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "rt.osk.nw.suzutan.jp" -> "rt.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.silverstone_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "silverstone_osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
        id                  = "43b42c6197c284982da97f6989ce6318"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:12Z" -> (known after apply)
!~      name                = "silverstone.osk.nw.suzutan.jp" -> "silverstone.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.spica will be updated in-place
!~  resource "cloudflare_dns_record" "spica" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
        id                  = "f4153b36a6b37bbe6b09ca359e51f7bd"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-05-18T08:15:28Z" -> (known after apply)
!~      name                = "spica.suzutan.jp" -> "spica"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #106](https://github.com/suzutan/infra/actions/runs/15217378126)